Documents/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>Тренировка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>InformationRegister.Рекорды</xr:Item>
				<xr:Item>InformationRegister.ПродолжительностьТренировок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тренер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Трененры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыВыполненияУпражнений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упражнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упражнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения3</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения4</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения5</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения6</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения7</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения8</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения9</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения10</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления3</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления4</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления5</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления6</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления7</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления8</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления9</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВосстановления10</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвентарь</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпортИнвентарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпортивныйИнвентарь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тренировка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПродолжительностьТренировок
	Движения.ПродолжительностьТренировок.Записывать = Истина;
	Движения.Рекорды.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТренировкаРезультатыВыполненияУпражнений.Упражнение.ВидСпорта КАК ВидСпорта,
		|	СУММА(РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения1, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения2, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения3, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения4, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения5, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения6, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения7, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения8, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения9, СЕКУНДА) + РАЗНОСТЬДАТ(&ПустаяДата, ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения10, СЕКУНДА)) КАК ВремяВыполнения,
		|	ТренировкаРезультатыВыполненияУпражнений.Упражнение.ВидСпорта.Код КАК КоличествоВидовСпорта,
		|	СУММА(РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления1, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления2, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления3, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления4, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления5, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления6, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления7, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления8, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления9, &ПустаяДата, СЕКУНДА) + РАЗНОСТЬДАТ(ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления10, &ПустаяДата, СЕКУНДА)) КАК ВремяВосстановления
		|ИЗ
		|	Документ.Тренировка.РезультатыВыполненияУпражнений КАК ТренировкаРезультатыВыполненияУпражнений
		|ГДЕ
		|	ТренировкаРезультатыВыполненияУпражнений.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТренировкаРезультатыВыполненияУпражнений.Упражнение.ВидСпорта,
		|	ТренировкаРезультатыВыполненияУпражнений.Упражнение.ВидСпорта.Код
		|ИТОГИ
		|	СУММА(ВремяВыполнения),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоВидовСпорта),
		|	СУММА(ВремяВосстановления)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоИтогам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоИтогам.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаПоИтогам.Выбрать();	
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			  
		
		Движение = Движения.ПродолжительностьТренировок.Добавить();
		Движение.Период = Дата;
		Движение.Спортсмен = Спортсмен;
		Движение.ВидСпорта = ВыборкаДетальныеЗаписи.ВидСпорта;
		Движение.ПродолжительностьТренировки = (Продолжительность-Дата("00010101"))/ВыборкаПоИтогам.КоличествоВидовСпорта; 		
		Движение.ВремяВыполненияУпражнений = ВыборкаДетальныеЗаписи.ВремяВыполнения;
		Движение.ВремяОтдыха = ВыборкаДетальныеЗаписи.ВремяВосстановления; 	
		КонецЦикла;	
	КонецЦикла;  	
	
	//регистрация рекордов	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТренировкаРезультатыВыполненияУпражнений.Упражнение,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений1 КАК КоличествоПовторений1,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений2 КАК КоличествоПовторений2,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений3 КАК КоличествоПовторений3,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений4 КАК КоличествоПовторений4,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений5 КАК КоличествоПовторений5,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений6 КАК КоличествоПовторений6,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений7 КАК КоличествоПовторений7,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений8 КАК КоличествоПовторений8,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений9 КАК КоличествоПовторений9,
	|	ТренировкаРезультатыВыполненияУпражнений.КоличествоПовторений10 КАК КоличествоПовторений10,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес1 КАК Вес1,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес2 КАК Вес2,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес3 КАК Вес3,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес4 КАК Вес4,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес5 КАК Вес5,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес6 КАК Вес6,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес7 КАК Вес7,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес8 КАК Вес8,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес9 КАК Вес9,
	|	ТренировкаРезультатыВыполненияУпражнений.Вес10 КАК Вес10,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения1,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения2,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения3,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения4,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения5,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения6,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения7,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения8,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения9,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВыполнения10,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления1,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления2,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления3,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления4,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления5,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления6,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления7,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления8,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления9,
	|	ТренировкаРезультатыВыполненияУпражнений.ВремяВосстановления10,
	|	УпражненияОтслеживаемыеПоказатели.Показатель,
	|	УпражненияОтслеживаемыеПоказатели.ЛучшееЗначение,
	|	ТренировкаРезультатыВыполненияУпражнений.Ссылка.Спортсмен
	|ПОМЕСТИТЬ Упражнения
	|ИЗ
	|	Документ.Тренировка.РезультатыВыполненияУпражнений КАК ТренировкаРезультатыВыполненияУпражнений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Упражнения.ОтслеживаемыеПоказатели КАК УпражненияОтслеживаемыеПоказатели
	|		ПО ТренировкаРезультатыВыполненияУпражнений.Упражнение = УпражненияОтслеживаемыеПоказатели.Ссылка
	|ГДЕ
	|	ТренировкаРезультатыВыполненияУпражнений.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Упражнения.Упражнение,
	|	Упражнения.КоличествоПовторений1 КАК КоличествоПовторений1,
	|	Упражнения.КоличествоПовторений2 КАК КоличествоПовторений2,
	|	Упражнения.КоличествоПовторений3 КАК КоличествоПовторений3,
	|	Упражнения.КоличествоПовторений4 КАК КоличествоПовторений4,
	|	Упражнения.КоличествоПовторений5 КАК КоличествоПовторений5,
	|	Упражнения.КоличествоПовторений6 КАК КоличествоПовторений6,
	|	Упражнения.КоличествоПовторений7 КАК КоличествоПовторений7,
	|	Упражнения.КоличествоПовторений8 КАК КоличествоПовторений8,
	|	Упражнения.КоличествоПовторений9 КАК КоличествоПовторений9,
	|	Упражнения.КоличествоПовторений10 КАК КоличествоПовторений10,
	|	Упражнения.Вес1 КАК Вес1,
	|	Упражнения.Вес2 КАК Вес2,
	|	Упражнения.Вес3 КАК Вес3,
	|	Упражнения.Вес4 КАК Вес4,
	|	Упражнения.Вес5 КАК Вес5,
	|	Упражнения.Вес6 КАК Вес6,
	|	Упражнения.Вес7 КАК Вес7,
	|	Упражнения.Вес8 КАК Вес8,
	|	Упражнения.Вес9 КАК Вес9,
	|	Упражнения.Вес10 КАК Вес10,
	|	Упражнения.ВремяВыполнения1 КАК ВремяВыполнения1,
	|	Упражнения.ВремяВыполнения2 КАК ВремяВыполнения2,
	|	Упражнения.ВремяВыполнения3 КАК ВремяВыполнения3,
	|	Упражнения.ВремяВыполнения4 КАК ВремяВыполнения4,
	|	Упражнения.ВремяВыполнения5 КАК ВремяВыполнения5,
	|	Упражнения.ВремяВыполнения6 КАК ВремяВыполнения6,
	|	Упражнения.ВремяВыполнения7 КАК ВремяВыполнения7,
	|	Упражнения.ВремяВыполнения8 КАК ВремяВыполнения8,
	|	Упражнения.ВремяВыполнения9 КАК ВремяВыполнения9,
	|	Упражнения.ВремяВыполнения10 КАК ВремяВыполнения10,
	|	Упражнения.ВремяВосстановления1 КАК ВремяВосстановления1,
	|	Упражнения.ВремяВосстановления2 КАК ВремяВосстановления2,
	|	Упражнения.ВремяВосстановления3 КАК ВремяВосстановления3,
	|	Упражнения.ВремяВосстановления4 КАК ВремяВосстановления4,
	|	Упражнения.ВремяВосстановления5 КАК ВремяВосстановления5,
	|	Упражнения.ВремяВосстановления6 КАК ВремяВосстановления6,
	|	Упражнения.ВремяВосстановления7 КАК ВремяВосстановления7,
	|	Упражнения.ВремяВосстановления8 КАК ВремяВосстановления8,
	|	Упражнения.ВремяВосстановления9 КАК ВремяВосстановления9,
	|	Упражнения.ВремяВосстановления10 КАК ВремяВосстановления10,
	|	Упражнения.Показатель КАК Показатель,
	|	Упражнения.ЛучшееЗначение,
	|	Упражнения.Спортсмен,
	|	ЕСТЬNULL(РекордыСрезПоследних.Результат, 0) КАК Рекорд
	|ИЗ
	|	Упражнения КАК Упражнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Рекорды.СрезПоследних(&ДатаЗапроса, Спортсмен = &Спортсмен) КАК РекордыСрезПоследних
	|		ПО Упражнения.Упражнение = РекордыСрезПоследних.Упражнение
	|			И Упражнения.Спортсмен = РекордыСрезПоследних.Спортсмен
	|			И Упражнения.Показатель = РекордыСрезПоследних.Показатель";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Спортсмен", Спортсмен);
	Параметры = Новый Массив(2);
	Параметры[0] = Дата;
	Параметры[1] = ВидГраницы.Исключая;
	Граница = Новый(Тип("Граница"),Параметры);
	Запрос.УстановитьПараметр("ДатаЗапроса", Граница);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Показатель <> Перечисления.Показатели.Вес и  Выборка.Показатель <> Перечисления.Показатели.ВремяВосстановления и Выборка.Показатель <> Перечисления.Показатели.ВремяВыполнения и  Выборка.Показатель <> Перечисления.Показатели.КоличествоПовторений Тогда
			Продолжить;
		КонецЕсли;
		ИндексЗначенияПеречисления = Перечисления.Показатели.Индекс(Выборка.Показатель);
		ИмяЗначенияПеречисления = Метаданные.Перечисления.Показатели.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя; 
		ЛучшийПодход = Выборка[ИмяЗначенияПеречисления+1];

		
		МатематическоеДействие = Метаданные.Перечисления.Экстремумы.ЗначенияПеречисления[Перечисления.Экстремумы.Индекс(Выборка.ЛучшееЗначение)].Имя; 
		
		
		
		
		Для н=2 по 10 Цикл  
			Если ЗначениеЗаполнено(Выборка[ИмяЗначенияПеречисления+н]) Тогда
				Если ТипЗнч(Выборка[ИмяЗначенияПеречисления+н]) = Тип("Дата") Тогда
					 ТекущийПодход = Выборка[ИмяЗначенияПеречисления+н]-Дата("00010101");
				     ЛучшийПодход = ЛучшийПодход-Дата("00010101");
					 Выполнить("ЛучшийПодход ="+МатематическоеДействие+"(ТекущийПодход,ЛучшийПодход)");
					 ЛучшийПодход = Дата("00010101")+ЛучшийПодход;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено (Выборка.Рекорд) Тогда
			Если ТипЗнч(ЛучшийПодход) = Тип("Дата") Тогда
				ЛучшийПодход = ЛучшийПодход-Дата("00010101");
			КонецЕсли;
			
			Выполнить("НовыйРекорд ="+МатематическоеДействие+"(Выборка.Рекорд,ЛучшийПодход)");				
		Иначе			
			НовыйРекорд = ЛучшийПодход;		
		КонецЕсли;
		
		Если НовыйРекорд<>Выборка.Рекорд Тогда
			Движение = Движения.Рекорды.Добавить();
			Движение.Период = Дата;
			Движение.Показатель = Выборка.Показатель;
			Движение.Спортсмен = Спортсмен;
			Движение.Упражнение = Выборка.Упражнение;
			Если ТипЗнч(НовыйРекорд) = Тип("Дата") Тогда
				НовыйРекорд = НовыйРекорд-Дата("00010101");
			КонецЕсли;
			Движение.Результат = НовыйРекорд;
		КонецЕсли;

		
	КонецЦикла;
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры
